Agenda de programacion clockeada.                             [[file:~/py1local/fichaje.py][fichaje.py]]
#+BEGIN: clocktable :maxlevel 2 :scope file
#+CAPTION: Clock summary at [2017-09-02 sáb 21:45]
| Headline                                       |       Time |         |
|------------------------------------------------+------------+---------|
| *Total time*                                   | *3d 19:55* |         |
|------------------------------------------------+------------+---------|
| Tab pedidos                                    |   1d 21:08 |         |
| \emsp DONE haciendo subtab pasar clientes...   |            |    1:16 |
| \emsp DONE bosquejamos el pasado de pedido     |            |    1:41 |
| \emsp DONE agregando posibilidad de carga...   |            |    1:00 |
| \emsp DONE parte logica - guardado del pedido  |            |    0:32 |
| \emsp DONE poner la linea check anulado/...    |            |    0:30 |
| \emsp nuevas ideas                             |            | 1d 1:35 |
| \emsp DONE poner infoseven en datos de...      |            |    0:11 |
| \emsp DONE revisar porque cuando se pasa un... |            |    0:14 |
| \emsp DONE arreglar el verpedidos de tabver... |            |    0:05 |
| \emsp DONE mejorar aun mas combobox nuevos     |            |    0:28 |
| \emsp DONE mejoras en la rapidez del pasado... |            |    2:01 |
| \emsp DONE mejoras en el documento             |            |    1:01 |
| \emsp TODO tablero informativo promotores 2018 |            |    6:56 |
| \emsp TODO mejorar pasado de cliente nuevo...  |            |    2:13 |
| tab seven                                      |       0:51 |         |
| tabVentas                                      |       1:31 |         |
| \emsp verificacion bug                         |            |    0:41 |
| \emsp DONE borrado de quieren comprar          |            |    0:50 |
| tabFichas                                      |       1:11 |         |
| \emsp DONE Imprimir listado desde Todos o Mora |            |    0:19 |
| \emsp DONE Poner zonas elva y monica en...     |            |    0:05 |
| \emsp DONE Revisar los criterios de...         |            |    0:20 |
| \emsp DONE Posibilidad de intimar...           |            |    0:09 |
| \emsp DONE Emision de un resumen de...         |            |    0:18 |
| tabVer                                         |       6:24 |         |
| \emsp DONE posibilidad de condonar             |            |    1:09 |
| \emsp DONE que el tab-ver sirva tambien...     |            |    1:57 |
| \emsp DONE poner el tbl de art comprado a...   |            |    0:47 |
| \emsp TODO hacer un subtab que se vean las...  |            |    0:53 |
| \emsp DONE info verificacion seven             |            |    0:16 |
| \emsp DONE Historial de pedidos                |            |    0:35 |
| Bug reaparece                                  |       2:20 |         |
| \emsp tabFechar                                |            |    0:46 |
| \emsp reviso con pycharm lado a lado           |            |    1:34 |
| tab-Doc                                        |       1:23 |         |
| \emsp DONE Marcar doc como llevado a...        |            |    1:23 |
| TODO Generales                                 |       1:16 |         |
| \emsp TODO campos entry mas diferenciados o... |            |    0:21 |
| \emsp TODO ver la forma de que el...           |            |    0:55 |
| TODO Modulos futuros                           |       2:44 |         |
| \emsp TODO modulo de devoluciones de articulos |            |    2:44 |
| DONE tabVer accesible desde todo el...         |       0:29 |         |
| \emsp DONE interconexion en tabver idem a...   |            |    0:08 |
| DONE chequear posibles bugs                    |       0:05 |         |
| \emsp DONE tab order en pasado de pedidos...   |            |    0:03 |
| \emsp DONE que paso, se achicaron los...       |            |    0:02 |
| TODO improvs                                   |       0:21 |         |
| \emsp DONE linkear desde fichas a fechar...    |            |    0:21 |
| DONE tabCobrado                                |       1:51 |         |
| \emsp DONE pivot por cobrar                    |            |    1:18 |
| \emsp DONE generalizar la disposicion para...  |            |    0:13 |
| \emsp DONE agregar a tabla virtual cuotas...   |            |    0:20 |
| DONE Sumador                                   |       1:24 |         |
| TODO tabSeven                                  |       1:05 |         |
| \emsp DONE Sistema de baja del seven           |            |    1:05 |
| DONE tema combobox                             |       0:36 |         |
| DONE bug tabVer                                |       0:29 |         |
| DONE bug tab Visitar:                          |       0:28 |         |
| DONE bug de los dos articulos en tab...        |       0:39 |         |
| TODO sistema de atencion telefonica            |       1:27 |         |
| \emsp al marcar llamar en fechar guardar en... |            |    1:27 |
| TODO tab PasarVentas [nuevo]                   |      15:07 |         |
| \emsp TODO subtab pasado propiamente dicho     |            |   15:07 |
| TODO Temas generales                           |       1:06 |         |
| \emsp DONE scroll para tablelist               |            |    0:42 |
| \emsp DONE stripebg en tbls que cambie por...  |            |    0:24 |
| bugs                                           |       4:00 |         |
| \emsp problema database locked                 |            |    4:00 |
#+END:

* Tab pedidos                                                       :urgente:
CLOCK: [2016-10-25 mar 12:16]--[2016-10-25 mar 12:31] =>  0:15
CLOCK: [2016-10-24 lun 21:59]--[2016-10-24 lun 22:22] =>  0:23
CLOCK: [2016-10-24 lun 19:45]--[2016-10-24 lun 20:32] =>  0:47
** DONE hice una subclase de Buscar que se llama BuscarConPadron
que hereda de Buscar y redefine el metodo show, para permitir filtrar
si el usuario ingreso un dni con prefijo f/F/m/M y busca en el padron
femenino o masculino el numero, y ello sin importar si el cliente ya
existe en Romitex. (cosa que no se podia en las busqueda
semiautomaticas de dni.tcl)
** DONE Inicie el tab y puse el cuadro de Buscar en un frame
** DONE Le agregue funcionalidad de busqueda por nombre pf'Filippi Ana'
*** ojo con el elif                                                 :pitfall:
agrego un branch mas a un if elif else y no actualizo bien. y queda 
if
if
elif
else
y produce errores raros, y es que el flujo va dos veces por un if que
pretende ser excluyente.
** DONE Arregle toque final class Buscar/BuscarConPadron


Agregue o bien mejore y estableci el metodo colsel del tablelist que
te permite poner las columnas ya de entrada en la definicion del tbls
con el select que vamos a usar y no dejar que se cargue automaticamente.
** DONE haciendo subtab pasar clientes nuevos
CLOCK: [2016-10-25 mar 19:01]--[2016-10-25 mar 19:15] =>  0:14
CLOCK: [2016-10-25 mar 13:06]--[2016-10-25 mar 13:30] =>  0:24
CLOCK: [2016-10-25 mar 13:47]--[2016-10-25 mar 14:25] =>  0:38
ya esta casi listo.  Falta corregir el metodo clear de los combos de
bwidget que no andan. para el boton limpiar. Lo hice asi separado, pq
en este pasador nuevo quiero seguir el zen de python explicito mejor
que implicito.
pasado de cliente nuevo en tab aparte, que quede ahi los datos hasta
qu expresamente los limpie, etc.
Era un bug en bwidget.py, ya lo arregle pero lo mismo no limpia.
** DONE bosquejamos el pasado de pedido
CLOCK: [2016-10-29 sáb 11:29]--[2016-10-29 sáb 11:51] =>  0:22
CLOCK: [2016-10-29 sáb 11:17]--[2016-10-29 sáb 11:27] =>  0:10
CLOCK: [2016-10-28 vie 19:50]--[2016-10-28 vie 20:23] =>  0:33
dejo para despues cuando tenga mas concentracion.
Pasado de pedido: Encabezo el subtab con id y nombre del que compra y
luego vamos con los datos del pedido en si.
CLOCK: [2016-10-28 vie 11:51]--[2016-10-28 vie 12:27] =>  0:36
Done: Tanto buscando en el cuadro buscar como creando un cliente nuevo
se termina en subtab pedido con un encabezado en label rojo con el id
y nombre del cliente a procesar.
Inicio apenas el pedido.

bugs: class LabelFecha que ponga la fecha de hoy con . o h.
arreglar los tamaños de la linea.
Corregido. Estaban mal los nombres de los keysym era period y
KP_Decimal para punto y habia un error en delete(0,END,hasta) el hasta
estaba de mas.
Arreglado los tamaños a mano y agregado el campo de info seven, que
tendra que ser registrado en algun lado, lo cual no es malo, pq toda
esa data siempre se perdio y es muy relevante. .
** DONE agregando posibilidad de carga general de datos
CLOCK: [2016-10-29 sáb 12:09]--[2016-10-29 sáb 13:09] =>  1:00
ya esta hecha la linea de datos, que funciona a nivel general. Me
trabo un bug o un pitfall de labelentry con el metodo set, que ya lo
he tenido, es decir cuando asigno mediante un bind un valor a un
labelentry se ponen unos signos raros en el campo lanzador del bind y
no surte efecto el bind, yo lo atribuia en principio a que andaba mal
el teclado fisico mio, pero aca lo probe con entrys sueltos o sea sin
label entry y anda joyita o sea que eso me plantea el tema de tener
que usar esos atajos que en principio parecieron ideales y que ahora
no lo son. pq en el caso de que tengo que usar un frame horizontal, es
rapidisimo incorporar los label sueltos y el ancho se calcula solo y
mejor.
** DONE parte logica - guardado del pedido
CLOCK: [2016-10-29 sáb 20:32]--[2016-10-29 sáb 21:04] =>  0:32
guardado todos los campos en tabla pedido. No se guardan los que no
son relevantes en esta etapa p.e. fechaentrega pq suponemos como regla
de negocio que el promotor vende para entregar en lo inmediato y se
puede suponer una fecha de entrega del mismo dia o dia siguiente. 
Alli faltaria una funcion dia-habil-siguiente. TODO
Guardo la infoseven recabada en un campo agregado en tabla clientes
para uso posterior.
Puse un tbls de muestra con recalc automatico.
** DONE poner la linea check anulado/ causa anulamiento.
CLOCK: [2016-10-29 sáb 22:24]--[2016-10-29 sáb 22:54] =>  0:30
estaria listo esa parte en lo visual. faltaria la parte logica o sea
incluirlo en el guardado.
Y establecer borrado en el tbls de pedidos.
** nuevas ideas
*** DONE que la busqueda dni, empalme a padron directo
y aparte esten las ya programadas de padron f/m/pf/pm
*** DONE que haya un buffer de edicion de datos/ingreso de cliente nuevo
CLOCK: [2016-10-31 lun 12:27]--[2016-10-31 lun 12:56] =>  0:29
CLOCK: [2016-10-31 lun 11:37]--[2016-10-31 lun 12:27] =>  0:50
en el mismo set de campos

*** como se ingresaria un pedido
uno pone el dni que da el promotor, si coincide barbaro, si no
coincide lo tenes que buscar por nombre y/o direccion, para evitar
homonimos y avivados, ya ahi el viejo rx fallaba y el cuadro de
busqueda es muy potente para eso.
Pero luego no debemos quedar sin el cuadro de edicion de
datos/agregado pq es mas practico, y luego pasamos el pedido. Podemos
ver un tbls aunque sea chiquito de confirmacion de pedidos pasados,
pero en un subtab aparte tenemos todos los pedidos.
*** DONE hacer un tipo packer-linea como tenia antes
CLOCK: [2016-10-31 lun 11:00]--[2016-10-31 lun 11:37] =>  0:37
eso permitiria componer la linea mas facilmente y luego packear o
placear las lineas en si.
el codigo quedara mas compacto y sera mas facil y rapido programar.
*** Poner un cuadro de informacion resaltada en el frente a la derecha
CLOCK: [2016-10-31 lun 14:05]--[2016-10-31 lun 14:36] =>  0:31
deudor, seven, pagando, pedido rechazado, lista negra, etc. cosa de
que no sea facil pasarse por alto un moroso cuando uno pasa el pedido.
El cuadro de informacion de cliente debe asegurar que uno no se
equivoque y que pueda investigar mas si hace falta. 
Indicar p.e. si hay otros clientes en la direccion, (lo ideal seria
que tambien vea si hay morososos en direcciones cercanas).

*** DONE guardar cliente nuevo editar cliente
CLOCK: [2016-10-31 lun 21:33]--[2016-10-31 lun 22:12] =>  0:39
al apretar boton guardar define editar o crear depende si existe el
idcliente, editamos todos los datos muy facilmente y nos avisa un
balloon que ha sido editado o creado el cliente.
*** DONE mejorar el tabVer para que se pueda dirigir alli las vistas
CLOCK: [2016-11-04 vie 13:03]--[2016-11-04 vie 13:30] =>  0:27
CLOCK: [2016-11-04 vie 11:50]--[2016-11-04 vie 12:23] =>  0:33

dirige a Fechar por necesidad, tendria que arreglar la pestaña Ver
para que se pudiera ver ahi, con mas claridad. faltaria un encabezado
de busqueda individual.
Arregle un poco Ver, dandole un encabezado, pero no nos olvidemos que
Ver no tiene por el momento edicion, la edicion la hemos concentrado
en Fechar.
*** TODO varios pensados este finde
**** DONE agregar fecha de entrega
CLOCK: [2016-11-06 dom 18:02]--[2016-11-06 dom 18:58] =>  0:56
por ahora puede ser dia siguiente, lo ideal una funcion dia siguiente
habil. 
Ya hice una funcion diahabilsiguiente con feriados incluidos, solo
necesita cargar los feriados en lib.tcl.

**** DONE cuando se agrega pedidos limpiar campos, 
CLOCK: [2016-11-06 dom 19:49]--[2016-11-06 dom 20:45] =>  0:56
CLOCK: [2016-11-06 dom 19:25]--[2016-11-06 dom 19:38] =>  0:13
cambiar el check que puede activarse por error y poner el tbls de
control con el nombre del cliente tmb.

**** TODO historial de Buscar

**** DONE mejora de tbls class buscar coloreado segun situacion
CLOCK: [2016-11-08 mar 20:17]--[2016-11-08 mar 20:58] =>  0:41
y de paso mejora de Buscar o sea otros coloreados segun situacion de
deuda.
puse un campo case when, llamado mora que calcula la deuda si tiene
mas de 60 dias que no paga y lo pone en mora y va en rojo, sino va en
azul. y pongo en gris los que no compraron nunca.

*** DONE pestaña resumen de pedidos donde se pueda ver los pedidos
CLOCK: [2016-11-07 lun 12:20]--[2016-11-07 lun 12:46] =>  0:26
CLOCK: [2016-11-07 lun 12:00]--[2016-11-07 lun 12:20] =>  0:20
segun diversos criterios, todos, pendientes, entregados,
Antes en una primera parte se acomodo el tbl de Buscar para que
muestre los campos en un orden mas logico, o sea
nombre,dni,calle,num,deuda,ultpago,ultcompra
y despues zona,barrio,acla,etc. sino es poco util.
Hice una pestaña con vision de pedidos con botones a media, todos,
pendientes, anulados o entregados.
*** DONE borrado de pedido en ambos tbls
CLOCK: [2016-11-07 lun 13:06]--[2016-11-07 lun 13:15] =>  0:09
ya esta borrado para ambas tbls con el mismo proc.
*** DONE coloreado segun estado y cambio de estado con teclado
CLOCK: [2016-11-07 lun 18:26]--[2016-11-07 lun 19:34] =>  1:08
CLOCK: [2016-11-07 lun 15:10]--[2016-11-07 lun 16:03] =>  0:53
mientras tenga pasador de ventas propio, cambiar de estado rapidamente
con e o a.
Vere que se puede hacer con el coloreado con metodo resaltar para
seguir teniendo recalc, y tener mas de un resaltar.
TErminado un metodo general para colorear tbls con un metodo facil de
usar que se llama resaltado.
*** DONE replantear campos entregado/anulado/pendiente
CLOCK: [2016-11-07 lun 20:04]--[2016-11-07 lun 21:01] =>  0:57
porque es un quilombo y da muchos errores y dolores de
cabeza... reales.
Terminamos usando un solo campo el cual sirve para concentrar el
status
y permitiria en el futuro incluso ampliarla a voluntad, p.e. con el
rechazado.
que joder lo hago ahora que estoy justo en el tema.
listo tengo rechazado por el cliente en status 3.

*** DONE bug: cliente nuevo
CLOCK: [2016-11-07 lun 21:02]--[2016-11-07 lun 21:30] =>  0:28
Listo. Puse un boton nuevo. No obstante me hace ruido la posibilidad
de que yo mismo o alguien mas pueda cometer el mismo bug. Quizas no
deberia dejar que se pudiera alterar el dni, y ello trabaria la
posibilidad de  cambiar desde ese lugar de uso tan frecuente y rapido
un dato de cliente como me paso hoy.

*** DONE eliminar que se pueda cambiar el dni desde el tab pedidos
CLOCK: [2016-11-08 mar 11:39]--[2016-11-08 mar 11:54] =>  0:15
o bien poner un aviso de posible error.
Puse un flag que avisa e impide en caso de que no se conteste que si
avanzar en la edicion de un cambio de de dni.

*** DONE agregar la vista de ex-calle-exnum etc 
CLOCK: [2016-11-08 mar 13:15]--[2016-11-08 mar 13:31] =>  0:16
agregado una pestaña mas en tabVer, lo cual es un servicio extra a una
funcionalidad primitiva de la base de datos pero que nunca se programo
para verla, quedara en el futuro el ampliar alli mismo el modulo de
cambio de direcciones
*** DONE posibilidad de pasar en algun lado el resultado de seven
CLOCK: [2016-11-07 lun 13:17]--[2016-11-07 lun 13:34] =>  0:17
o del anulamiento luego de procesado el pedido, pq puede que uno lo
pase rapido y no necesariamente coincida con el control de seven.
Arregle el paso del anulado y comentario, que estaba mal, pero siendo
pedidos una tabla auxiliar (o sea no vinculante) no veo el sentido
para que se pase un pedido y luego despues de pasado se verifique en
el seven y se quiera updatear en otro lado.
o bien se van verificando en paralelo hasta la parte de los datos del
cliente que se van ingresando lo mismo o editando lo  mismo
acumulativamente y si se verifica seven, sin estar pasando el pedido,
se anota en el dato cosa que siempre hago, y luego ponele que paso el
dato anoto eso, es raro que pase el dato de una y despues vaya a
anularlo, y si pasara eso, lo borro al dato y lo paso de nuevo, borro
ventas a cada rato pq el codigo de art no me deja entrar, mira sino
voy a borrar un pedido.
*** TODO tablero de control promotores
al menos algo basico por ahora
**** DONE pivot vendedor/mes
CLOCK: [2016-11-20 dom 17:26]--[2016-11-20 dom 17:46] =>  0:20
ultimo año, usando un esquema similar al del tab cobrado, o sea linea
de botones arriba y reusado del tbls via resetcols
**** DONE pivot zona/mes
CLOCK: [2016-11-20 dom 18:05]--[2016-11-20 dom 18:20] =>  0:15
tanto sistema cortinas como visita

**** DONE cortinas por dia - sumable
CLOCK: [2016-11-20 dom 18:35]--[2016-11-20 dom 18:58] =>  0:23
**** DONE ganancia-real por dia - sumable 
aca quiza necesito una tabla
***** DONE tabla de pasado de jornales
CLOCK: [2016-11-22 mar 11:30]--[2016-11-22 mar 11:49] =>  0:19
id-fecha-prom-sueldo-cospel-cnt
listo junto con la linea de pasado.
***** DONE tbls que muestra los registros de pagos
CLOCK: [2016-11-22 mar 13:33]--[2016-11-22 mar 13:53] =>  0:20
***** DONE cargar datos en oficina
***** DONE pivot ganancia por semana y por mes
CLOCK: [2016-11-22 mar 21:27]--[2016-11-22 mar 21:42] =>  0:15
listo.
**** TODO Pedidos/semana 
**** TODO info extra en Resumen
***** TODO pedidos por promotor
CLOCK: [2016-11-22 mar 21:46]--[2016-11-22 mar 21:48] =>  0:02
si es posible usando tree.
***** TODO pedidos por fecha
***** DONE pedidos por zona - analisis global 
CLOCK: [2016-11-22 mar 21:53]--[2016-11-22 mar 22:12] =>  0:19
responder a la pregunta a que barrio vamos con la promo. Ahi me hago
una pregunta, como diferenciamos las ventas de otro origen, con las
promo, donde se manifiesta eso?. Que pasaria si de pronto los
cobradores venden como antes, o si algunos vendedores visitan
clientes.
Por lo pronto, puedo distinguir como promo las ventas hechas a traves
de pedido, desde el 26-10-2016.
*** DONE edicion de pedidos
CLOCK: [2016-11-15 mar 21:10]--[2016-11-15 mar 21:15] =>  0:05
posibilidad de editar cnt, y color y fecha de pago, que serian los
items que pueden cambiar en los pedidos para no tener que borrarlo al
vicio.
Es algo estandard pero muy util que se permita la edicion de todos los
campos del pedido.

*** DONE datos para la evaluacion del pedido
CLOCK: [2016-11-15 mar 20:55]--[2016-11-15 mar 21:10] =>  0:15
falta informacion zonal para saber si hay otras deudas en la direccion
cosa que no esta ocurriendo aca.
quizas puede ser por medio de al terminar de pasar calle y numero
cargar eso en el buscador y activar la busqueda.
Listo: Mas facil que lo que pensaba, un bind a numero, con focusout
para que funcione con tab o enter y eso directamente actua sobre los
metodos de la class buscar, primero hago set a Buscar.buscar y luego show
Y como con doble click los analizo sin perder ningun foco, esta
bueno. Y si quiero con C me voy a la cuadra.
Algo muy bueno y colateral es que el solo paso por num, te llena no
solo el resultado sino el campo buscar de la class Buscar, dejandolo
alli para modificarlo sin el tedio de escribir de nuevo
yo. P.e. supongamos Mna 52 (Ituizango) 14, que se escribe tal cual
esta la calle hecha. Y supongamos que quiero ver todos los clientes en
la manzana, entonces borro el 14 y enter, veo todos, si se me borra,
paso de nuevo por el num y se regenera el campo... Precioso.

*** DONE edicion de los campos del pedido
CLOCK: [2016-11-16 mié 13:45]--[2016-11-16 mié 14:16] =>  0:31
lista la primera parte, se puede editar todo lo relevante, quedaria
para el futuro ver no me acuerdo y estudiar si queremos que se editen
fechas con mas o menos dentro del tablelist.
Me parece medio irrelevante, siendo que hay un lugar para ingresarlo y
el tbls sirve a los fines solo de editar.
Listo tambien en el otro tbl, en el cual hay un campo extra comentario
que no esta en el frente, que es util para los rebotados.

*** DONE pasado directo del pedido como venta
CLOCK: [2016-11-18 vie 21:02]--[2016-11-18 vie 21:14] =>  0:12
que el E de entregado sea pasado como venta, ya que cuando trabajamos
con pedidos lo unico que se hace es pasar todo automaticamente, pero
todo esta igual.
Habria que chequear el dni, que en realidad el pasado sirve para eso,
porque me pregunto en el futuro cuando haya mas gente trabajando, y
haga el documento nuevo, voy a sacar la referencia al dni dentro del
documento y como controlo que realmente firmo la compradora sino lo
paso al pedido y compruebo ahi mismo. Pero puede haber otra
forma. p.e. que en el tbls de pendientes que es donde se procese esto
este el dni y yo lo testee ahi, junto con el nombre, ponga E. y me de
el numero de cuenta. Previamente edito la fecha de pago si hay una
modificacion.

**** DONE Podriamos poner un campo extra en pedido: idvta
CLOCK: [2016-11-23 mié 11:22]--[2016-11-23 mié 11:50] =>  0:28
y un trigger en ventas que ponga el idvta cuando se pase la venta
y el tbls que muestro contener el idvta y luego del E, recalcularse y
alli me aparecera el numero de cuenta. Aparte de un balloon.

**** DONE problema de la funcion pmovto que esta incrustada en los triggers
CLOCK: [2016-11-23 mié 11:59]--[2016-11-23 mié 12:50] =>  0:51
ademas de ser todos viejos los triggers, tiene esa funcion incrustada
dentro.
Solucionada incluso en version de ambos planes, aunque el plan semanal
es obsoleto.
Despues de mucho renegar se pulio una funcion internamente, y estoy
puliendo o mejor dicho borrando muchos triggers que agregan datos que
en realidad no usamos nunca, esta bien que no enlentece en nada la
base de datos pero es una maraña dificil de mantener, creo que hay que
seguir puliendo. Al menos termine con una solucion a la funcion
pmovto.
#+BEGIN_EXAMPLE
pmovto=CASE WHEN p in (1,'1') THEN
(select date(new.primera, printf('+%s months',round((new.ent+new.pagado)/new.ic))))
WHEN p in (3,'3') THEN
(select date(new.primera, printf('+%s days',round((new.ent+new.pagado)/new.ic)*7)))
END
 where id=new.id;
#+END_EXAMPLE
Con el sistema de trabajo que tengo ahora al menos llevo una pista.
Creo que no deberia borrar los provisorios, sino irlos dejando como
documentacion.
En especial la operacion sobre tablas y triggers es muy importante.
Incluso le agregaria el copiado de los trigger que voy borrando, o al
menos ponerlos aca.
Esta bien que estan en cualquier copia de la base de dato previo a la
operacion.

**** DONE pasado del detalle de venta 
CLOCK: [2016-11-23 mié 13:03]--[2016-11-23 mié 13:13] =>  0:10
ya esta. 
Aca quiero notar el uso del lastrowid. Como paso primero la venta en
tabla Ventas, y obtengo el idventa que luego necesito para detvta,
ahorro un paso poniendo
idvta = con.execute( bla bla el insert en tabla ventas ...).lastrowid
entonces paralelamente a ejecutar el insert, cargo en la variable
idvta la propiedad lastrowid del con.execute que me da el ultimo id
insertado.

**** DONE cambio de status en pedido y puesta del idvta
CLOCK: [2016-11-23 mié 13:13]--[2016-11-23 mié 13:37] =>  0:24
listo. Ya estaria. Quizas falta un poco que el balloon sea mas visible
o bien que se use un label mas visible cosa de no equivocar el numero
de cuenta.
Obviamente esto tiene que ir acompañado de una revision de los
documentos firmados para ver si la gente que firmo es la que deberia
haber firmado, pero eso se emparenta a otra cuestion, la del dato o el
pedido, pq con el pedido teniamos doble firma.
El tema es que con unas 12/15 ventas se puede uno ahorrar un buen
tiempito con este sistema de pasado directo.
*** TODO planilla de salida de mercaderia
alli se hara la clausula legal. Me firmaran todos los dias, en la
planilla no solo debe salir que mercaderia llevan sino que la llevan
para entregarla especificamente a dichas personas, y pondria una
clausula que diga en formato de contrato lo siguiente:
**** Los clientes destinatarios de los articulos que el vendedor lleva
han sido chequeados en funcion de la informacion traida por el
vendedor, en base a su verificacion visual del dni del cliente y se
compromete solidariamente a hacer firmar el documento a la misma
persona que genero el pedido y cuyos datos figuran en la planilla y en
el documento. En caso de no estar disponible la persona, el articulo
debe ser traido y entregado mañana. Cualquier falsedad en que incurra
la operacion no puede ser alegada como actuada por desconocimiento por
cuanto el vendedor esta expresamente encomendado a tener la precaucion
y tomar los recaudos para hacer firmar al cliente indicado que fue el
que el mismo trajo, y de cuya operacion el mismo se va a beneficiar,
resultando cualquier irregularidad un fraude directo a la empresa con
responsabilidad sobre el vendedor.
**** Las direcciones declaradas por el vendedor 
tienen el caracter de declaracion jurada y son tomadas como ciertas,
por cuanto tambien fueron informadas por el vendedor, cualquier
discrepancia debe ser corregida en el momento de la entrega. 
**** Formato de contrato
en si cuando lo explique al vendedor, le hago saber que el contrato de
entrega es un contrato aparte, que lo vincula a el en cada entrega que
hace y queda pegado a la veracidad de lo actuado con cada cliente en
particular.
Como esas hojas se guardan y de paso tienen orden puede ser
interesante para llevar un rastro de responsabilidad sobre el vendedor
de que si se manda una cagada la va a pagar el mismo, y en un contexto
en el cual no necesitamos ni queremos muchos promotores, todo pienso
que puede andar bien en ese sentido.-
 
*** DONE documento nuevo en python
CLOCK: [2016-11-29 mar 12:41]--[2016-11-29 mar 13:08] =>  0:27
CLOCK: [2016-11-28 lun 20:23]--[2016-11-28 lun 21:50] =>  1:27
CLOCK: [2016-11-28 lun 18:25]--[2016-11-28 lun 18:40] =>  0:15
avance en un 50%
**** documento - generar la funcion que traduce letras a numeros.
CLOCK: [2016-11-30 mié 12:51]--[2016-11-30 mié 13:59] =>  1:08
CLOCK: [2016-11-29 mar 13:09]--[2016-11-29 mar 13:48] =>  0:39
listo en forma pythonica en un 80% faltan detalles, la unidad, y
llenar los dicts.
**** linea de marca, romitex y direccion que se pueda poner como logo
CLOCK: [2016-12-02 vie 13:57]--[2016-12-02 vie 14:11] =>  0:14
CLOCK: [2016-11-30 mié 21:09]--[2016-11-30 mié 21:42] =>  0:33
total estara llevado y traido con git. Al final desisti e hice algo
simple por ahora.
*** DONE edicion y/o agregado calles/barrio/zonas
**** DONE edicion generica de cualquier tabla 
CLOCK: [2016-11-27 dom 19:35]--[2016-11-27 dom 20:28] =>  0:53
**** DONE filtrado de resultados
CLOCK: [2016-11-27 dom 20:39]--[2016-11-27 dom 21:21] =>  0:42
explorare la opcion crear una tabla virtual con fts4, Hecho, un
sistema todo generalizado, hasta ahora le agregue al tandem
calle,barrio,zona, articulos y cobradores, como todo es generalizado
todo joya.
**** DONE agregado de nuevos valores
CLOCK: [2016-11-27 dom 21:37]--[2016-11-27 dom 22:04] =>  0:27
veo si puedo usar el insertador. None.
Use el viejo y querido metodo de insertar un nuevo registro vacio en
el tbls y luego lo edito.
**** DONE borro registro genericamente en tbls editados
CLOCK: [2016-11-27 dom 22:04]--[2016-11-27 dom 22:20] =>  0:16
con incluso captura de error y muestra de un balloon al respecto.
Este es un temita para experienciar.
**** DONE recalculado de combobox
CLOCK: [2016-11-27 dom 22:24]--[2016-11-27 dom 23:00] =>  0:36
Hecho con el F11.

*** DONE ver problema combobox
CLOCK: [2016-11-25 vie 12:47]--[2016-11-25 vie 13:19] =>  0:32
analizare primero si puedo volver a poner los tk::combobox.
se cambio a ttk::combobox, creo que funcionara mejor, hago un
articulito aparte para el uso de combobox.
**** DONE intento validar la entrada o avisar que entre un valor malo
CLOCK: [2016-11-25 vie 13:32]--[2016-11-25 vie 13:45] =>  0:13
hermoso quedo la validacion dentro del combo y con grandes facilidades
de rapidez pq autocompleta, lo unico que por ahi seria mejor teclear
con algo de lentitud.
Y no vamos a incorporar el agregado de calles en los combos como tenia
en pedidos/ventas viejos pq aunque fue bastante guay, en su momento,
no verifica si hay otras calles, y no promueve la correccion de las
calles.
**** DONE hacer combo.clear()
CLOCK: [2016-11-27 dom 23:13]--[2016-11-27 dom 23:16] =>  0:03
para que limpie.
listo, pq con el Shift-F6 es facil ir para atras en PyCH entonces veo
de donde vienen los metodos del combobox y cuales se pueden usar, por
lo cual se puede trabajar muy facilmente.
** DONE poner infoseven en datos de cliente no en paso de pedido.
CLOCK: [2016-12-06 mar 20:44]--[2016-12-06 mar 20:55] =>  0:11
eso permite editar y/o ver la infoseven al levantar cualquier cliente.
** DONE revisar porque cuando se pasa un pedido anulado no se anula
CLOCK: [2016-12-06 mar 20:56]--[2016-12-06 mar 21:10] =>  0:14
Listo pq faltaba ese link habiendo quedado inutil tanto el checkbox.
** DONE arreglar el verpedidos de tabver para que se vea comentarios
CLOCK: [2016-12-06 mar 21:11]--[2016-12-06 mar 21:16] =>  0:05
y de paso poner en la vista principal del tabver la infoseven, como
parte de los datos o abajo de los tbs.

al menos ahora veo lo que hay que ver sin tener que observar campos
obsoletos.
** DONE mejorar aun mas combobox nuevos
*** DONE que al traverse con enter se seleccione todo
CLOCK: [2016-12-07 mié 20:06]--[2016-12-07 mié 20:09] =>  0:03

*** DONE ver si podemos enlentecer un poco
CLOCK: [2016-12-07 mié 20:09]--[2016-12-07 mié 20:34] =>  0:25
Al final no se puede hacer nada. Se podria usar
self.after(500,self.autocomplete())
pero no soluciona nada y al final el delay de marcacion hace que
tecleemos mas rapido y las letras aparezcan atras de lo escrito. Lo
ideal es acostumbrarse a teclear letra por letra para dar tiempo que
se rearme el combo con el select-range del resto de la palabra.

** DONE mejoras en la rapidez del pasado de pedidos
CLOCK: [2017-08-19 sáb 19:00]--[2017-08-19 sáb 21:01] =>  2:01
ponemos valores por defecto a la mayoria de los campos del pedido 
corrijo bug de no limpiar idcliente al cargar dato nuevo
nuevo boton para pedido doble del mismo cliente
*** mejoras en el pasado de DNI que no estan en padron 
CLOCK: [2017-09-06 mié 19:25]--[2017-09-06 mié 20:25] =>  1:00
es un pain diario con unos diez o mas datos que uno pasa el dni y
luego tiene que tipear de nuevo el dni en la pagina del seven y luego
copiar el nombre, pegar el nombre, y volver a tipear el dni, o sea
tengo que tipear tres veces el dni.
Logre que 
1. tipeo una sola vez el dni. y pasa tambien al campo, y se copia al
   portapapeles y lo pego directo al campo de seven.
2. me pone sexo femenino por defecto
3. me ubica en el campo nombre para pegar de una lo traido del seven
4. tambien hice una validacion para sexo que me permite poner 1 para
   femenino y 2 para masculino y que me valida errores.
Creo que esto mejorara bastante.

** DONE mejoras en el documento
CLOCK: [2017-08-19 sáb 22:01]--[2017-08-19 sáb 23:02] =>  1:01
ponemos wapp
ponemos infoseven
ordenamos por barrio,calle y numero: esto fue lo mas interesante pq
tuve que sacar una lista de los idpedido implicados y hacer que sqlite
ordene por via indirecta con la tabla clientes y escupa los idpedido
nuevamente ordenados para recien ahi procesarlos



** TODO tablero informativo promotores 2018

*** DONE subtab pedidos coloreados por promotor

CLOCK: [2017-08-20 dom 13:22]--[2017-08-20 dom 14:02] =>  0:40
Comenzamos por reusar un subtab informativo de pedidos coloreados por
distintas situaciones que estaba generalizado, poniendo un campo de
filtro por promotor para usarlo si quiero ver un promotor solo. Una
vez que tenga la carga completa de datos. Con 18 lineas mas de codigo
lo logre con el codigo que ya tengo.

*** DONE TD por dia de pedidos sacados y procesados
CLOCK: [2017-08-20 dom 20:05]--[2017-08-20 dom 21:37] =>  1:32
CLOCK: [2017-08-20 dom 23:00]--[2017-08-20 dom 23:58] =>  0:58
lo que tendria que hacer seria pasar todos los datos, incluidos los
anulados y los rechazados y poner la causa del rechazo, para que
aparezca ahi pq se rechazo. La idea seria tener una td que mostrara
los datos sacados por todos, sumable por los promotores activos.

Hice la Td de pedidos pero habria que acotarla y mejorarla para
hacerla funcional e informativa. 
P.e. que abarque de hoy 30 dias o 35 dias para atras
que este ordenada de hoy para atras
nozero o mejora en los colores de presentacion

Se toman los ultimos 31 dias moviles.
se sumariza el total de datos sacados los ultimos 31 dias
se usa la funcion nozero para no ensuciar la pantalla

no hace falta ordenar de arriba a abajo pq se ve en una sola pantalla

Hay que resolver el tema de que sumo cnt y en realidad tengo que sumar
clientes.
#+BEGIN_EXAMPLE
'select fechaped,idcliente,pedido.prom as prom from pedido,cobr where cobr.id=pedido.prom and cobr.activo=1 and \
        fechaped>date("now","-31 days") group by idcliente'
#+END_EXAMPLE

alli tomamos por cliente y no por cnt de articulos ni por multiples
pedidos al mismo cliente.

Al final cambie la condicion a prom=1 de la tabla cobr no a activo, pq
alli se incluye a cobradores y algunos hacen datos como el braian.
entonces editando ese campo tengo unicamente a los promotores.


*** DONE ver si se puede hacer la misma td con columna doble entregado-anulado
CLOCK: [2017-08-21 lun 11:17]--[2017-08-21 lun 11:43] =>  0:26
puse la segunda columna.
usando los status ya programados
1. sin entregar status 0
2. entregado status 1
3. anulado o seven status 2
4. rechazado por el cliente status 3
con un case when el pivot suma los datos de uno u otro tipo.

**** DONE coloracion de las columnas
CLOCK: [2017-08-21 lun 11:44]--[2017-08-21 lun 12:14] =>  0:30
hice una coloracion vertical por promotor usando los colores de paleta
de fossil.

**** TODO boton de recalculado de tabla dinamica
CLOCK: [2017-08-21 lun 12:14]--[2017-08-21 lun 12:24] =>  0:10
agregado boton de recalculado. 

*** DONE Botones dinamicos de num de promotor en el mostrador de pedidos
CLOCK: [2017-08-21 lun 18:41]--[2017-08-21 lun 19:47] =>  1:06
estaria bueno para agilizar la muestra un set de botones en segunda
fila de los numeros de promotores activos
Se hizo un update provisorio de limpiado del promotor inactivo en
forma automatica para el que no presente venta en los ultimos 35 dias,
mas alla de que podamos sacar antes alguno a mano, pq esto saca no
pone.
y genero los botones en forma automatica.
evito el problema del nominado de los botones, pq no los nomino solo
los asigno con un comando dinamico y una funcion q le va tomando el
numero de promotor como argumento.
Y luego una funcion simple que solo invoca el boton que tenemos
naturalmente.
O sea solo reuso lo que esta.
agregue tambien balloon con nombre del promotor cuando pasas el raton
por el boton, para aprenderse los nombres de los promotores.

*** DONE el subtab Pedidos(st2) pasarlo a tercer lugar
CLOCK: [2017-08-23 mié 20:54]--[2017-08-23 mié 22:15] =>  1:21
y por en el medio otro general de todos los datos para impresion y el
de los promotores que solo contenga los clientes o sea que sea fiel
reflejo de la planilla de cada promotor, sino es un despelote.
incluso para imprimir podria ser para ayudarme que cada dia fuera
coloreado diferente en los pendientes.
Termine la parte de poner aparte el trabajo de los promotores.
queda ahora el tema impresion
Terminada la st2 con la impresion separada de la st3 que esta
destinada a la vision de promotores.
Solo falto si queremos despues la separacion por colores de acuerdo a
dias. 

*** DONE Pedidos entregados. Corregir el programa pasador de ventas
por el momento cargar el idpedido cuando paso una venta para que tome
el dato de pedido entregado. Y pasar manualmente los pedidos anulados.

*** DONE Cambio los campos visibles en el visor de pedidos
CLOCK: [2017-08-24 jue 21:20]--[2017-08-24 jue 21:33] =>  0:13
agrego calle,num y zona

*** TODO Resumen por promotor con un listado de todos los datos y su resultado
coloreado por tipo de resultado, azul entregado, verde seven y rojo
rechazado y blanco pendiente, sumable o con resumen.

*** TODO tabla de meses o campañas de promotores, comienzo y final y resultado
para que se pueda hacer estadistica y reconstruir las planillas y los
pagos

** TODO mejorar pasado de cliente nuevo en pedido combobox y numero
CLOCK: [2017-08-25 vie 21:15]--[2017-08-25 vie 22:14] =>  0:59
CLOCK: [2017-08-25 vie 20:00]--[2017-08-25 vie 21:14] =>  1:14
ya es muy antiergonomico el tener que pasar todo con esos combobox,
busco otra solucion.
una hora catorce perdida en la experimentacion stasheada de combobox
autocomplete que no es aplicable pq le falta mucho para que sea usable
como p.e. que se pueda asignar valor al entrar.
*** Solucion Bwidget
lucen bien, y el autocomplete funciona joya, le puse como agregado la
funcion setvalues para que carge la configure(-values=) y sea igual a
lo que ya tengo.
Me faltaria tunearle lo de lo indistinto en mayusculas minusculas.
Y falta pulir algunos comportamientos pero creo que es mas funcional
que el pain que venia sufriendo con esto otro que no funcionaba.
*** No descartemos la funcionalidad del combobox_autocomplete para buscar
en un cuadrito de busqueda tipo fts para calles u otros campos que
pueden ser utiles en algunos contextos rapidos.
*** Nada es perdido de todo se aprende

* tab seven
CLOCK: [2016-10-29 sáb 19:09]--[2016-10-29 sáb 19:16] =>  0:07
CLOCK: [2016-10-29 sáb 18:41]--[2016-10-29 sáb 19:08] =>  0:27
CLOCK: [2016-10-29 sáb 18:06]--[2016-10-29 sáb 18:23] =>  0:17
revision
*** tema capitalizacion del nombre. 
yo lo hice con la planilla de calculo y pretendi hacerlo dentro de
python en un toque y no fue tan facil pq no salio bien.
capitalizo la primera parte del nombre.
seria split, capitalize, con excepciones del, las la de 
unir el string de nuevo
Se hizo una funcion que es mas eficiente que la funcion de libreoffice
que no tiene en cuenta las particulas.
*** tema bug calle arce cabeza de vaca ver.
solucionado via string.replace(',',' ') o sea limpio la cadena de
calle de todos los signos que puedan interferir.
* tabVentas
** verificacion bug
CLOCK: [2016-10-31 lun 19:28]--[2016-10-31 lun 20:09] =>  0:41
Solucionado, pero -no me gusta- no encontre la causa.
Al poner el numero de dni, busca el registro y lo carga pero el campo
que tiene el bind asignado se llena o se appendea con caracteres
raros.
Yo antes pensaba que era culpa de LabelEntry, y cambie por Label y
Entrys p.e. cuando hice el sabado el codart y art en el pedido, y hoy
pensaba que era la correccion a LabelEntry y Entry1 que le habia hecho
en el metodo set para que en caso de tener un valor nulo no diera
error (cosa que tambien esta muy en el aire y sin probar pero
permitio que siguiera adelante). 
La realidad es que el fallo proviene del campo que tiene un bind,
funciona el bind y deja los caracteres, que son unicode
incomprensibles segun el error de python.
Hice un parentesis para probar si era el problema que el bind agregaba
un caracter extra y debia ponerse break, o evitar el bind de evento
virtual, y nada, ni con <Return> puro, ni con break obtengo otro
resultado.
Lo real que levanto el registro, o sea que en el momento de gatillar
el bind, el valor del campo es correcto, pero luego se corrompe o se
le agrega unos caracteres malos, que aca no se ven, pero en la ofi si
se ven.
El workaround que tuve aca fue recargar el valor del campo, luego de
levantado, o sea hacer de nuevo p.e. dni.set(cliente['dni']) y
entonces tenemos el campo restaurado y listo para que el proceso siga.

Lo raro de todo es que fichitas funcionaba bien la semana pasada, y en
ofi pase un monton de fichitas. Y recien el sabado se manifesto este
problema.
Y no puede ser una actualizacion de tkinter pq aca la puedo haber
hecho pero en oficina no actualice nada y alla se  manifesto hoy el
problema.
Da para estudiarlo en el futuro.
** DONE borrado de quieren comprar
CLOCK: [2016-11-07 lun 13:39]--[2016-11-07 lun 14:29] =>  0:50
pq puede darse que me arrepienta de haberlo pasado.
Hecho: agregue borrado de quieren comprar, con linkeado a tabla
clientes, y doble click abre ficha en tabFechar.
** TODO fichita de pedidos diferenciada y con leyenda
a pedido del vendedor
* tabFichas
** DONE Imprimir listado desde Todos o Mora
CLOCK: [2016-11-09 mié 11:57]--[2016-11-09 mié 12:16] =>  0:19
Ya hecho, corregido bug, producido por pasar como argumento un
singleton que con su coma sobrante hacia pitear a sqlite.

** DONE Poner zonas elva y monica en fichas para poder imprimir resumenes
CLOCK: [2016-11-09 mié 12:17]--[2016-11-09 mié 12:22] =>  0:05
intimables y seveneables desde dentro.
Hecho. No hizo falta nada, solamente asignar un sector a las zonas de
esas cobradoras y aparecen dentro del listbox de zonas en fichas

** DONE Revisar los criterios de inclusion de las fichas en normal/mora/
CLOCK: [2016-11-09 mié 12:34]--[2016-11-09 mié 12:54] =>  0:20
El criterio que habia usado era un mes, o sea suponiendo que todas las
fichas se estaban arriando juntas para adelante con el fechamiento, la
fecha de corte se puso en un mes. Total se penso que habia tres
botones, selecciona/mora/todos, pero la realidad hizo que nunca
usaramos los botones, y el otro dia dentro del drawer de la mora de
patricios estaba la hora 2004 por ejemplo.
Ahora puse 6 meses, lo cual no es muy significativo y casi tira todo
para adelante. No queda nada que se pueda recuperar en el cajon de
mora de cada zona. Habria que ver elva y monica.


** DONE Posibilidad de intimar directamente en la pestaña mora
CLOCK: [2016-11-09 mié 12:55]--[2016-11-09 mié 13:04] =>  0:09
Facilmente agregue posibilidad de imprimir directamente con una letra
al viejo estilo (con i), desde cualquier ventana. 

** DONE Emision de un resumen de intimaciones
CLOCK: [2016-11-09 mié 13:07]--[2016-11-09 mié 13:25] =>  0:18
Genialmente, y gracias a pycharm rapidamente , hice un resumen de
intimaciones que se imprime automatico atras del lote.
(no creo necesario recargar la interface con un disparador de resumen,
ya que un sistema donde podemos unir las bochas, no hace falta, p.e
coco liso va a congreso y si3 , uno las dos zonas e imprimo
intimaciones juntas.)
Es un sistema aparte, que en cierta forma sirve como para un
intimador, como tenia antes. 

** TODO marcacion subir al seven generalizada tambien con letra
igual que las intimaciones generalizadas. - estudiar esto.
* tabVer
CLOCK: [2016-11-12 sáb 13:07]--[2016-11-12 sáb 13:54] =>  0:47
el tab ver seria el el F13 integrado dentro del sistema y tendria que
tener todo lo que el F13 tiene y mas. No puedo tener que "ir" al
tabFechar para editar solo por ahorrar unas lineas de codigo de cortar
y pegar. El tab-ver tiene que tener todo.
El tab-Ver es para atender bien y rapido al cliente, tanto por
telefono como personalmente.
Increible que siempre hayamos tenido que renegar para ver bien lo que
debe alguien. El viejo F13 se expande a lo ancho(cosa que nunca se
arreglo) y no a lo alto siendo que ocupa casi la mitad de la
pantalla. y le da solo cuatro lineas en tree a las cuentas, al abrir
el tree, quedan dos y media filas a la vista, y se ve usualmente desde
cero que suelen ser las pagadas, complicandose enormemente ver lo que
debe realmente la persona. Y luego abajo destino cuatro lineas a
recibos mezclados donde es dificultoso ver cual cuenta se pago si
estan entrelazadas.
En ese sentido hemos avanzado. Pero faltaria el poder sumar ahi mismo
las cuotas.
El resto de la funcionalidad del sistema debe ser estudiado asi, desde
lo que sea practico.
** DONE que el tabVer sea referenciable como metodo 
ya esta, se puede llamar self.mustracuentas(idcliente) y tenes la
cuenta vista, luego pulo como quiera el tabVer y tengo un F13 potente
desde cualquier funcionalidad que este trabajando, con una simpleza
que solo da python.
** DONE posibilidad de condonar
CLOCK: [2016-11-13 dom 17:33]--[2016-11-13 dom 18:07] =>  0:34
Agregado la funcion de condonar dentro del tab Ver. Es un subtab en el
cual aparecen las cuentas, y se resalta con indianred las que tienen
saldo y alli con dobleclick derecho se condona o se descondona con
dobleclick izquierdo.
Y a su vez queda el metodo condonacuenta para funcionar desde
cualquier lado por si luego lo necesito desde pasar recibos o algo.

**** hacer una funcion pmovto pura, pq la vamos a necesitar
CLOCK: [2016-11-13 dom 18:37]--[2016-11-13 dom 19:12] =>  0:35
(select date(new.primera, printf('+%s
months',round((new.ent+new.pagado)/new.ic))))
hermosa la funcion, la pongo dentro del trigger  puede ser con un case
when, quizas, y asi muy limpiamente me produce el pmovto. Sin depender
de una funcion externa.

** DONE que el tab-ver sirva tambien para editar en forma clara
CLOCK: [2016-12-08 jue 14:08]--[2016-12-08 jue 15:11] =>  1:03
CLOCK: [2016-12-07 mié 22:27]--[2016-12-07 mié 22:45] =>  0:18
CLOCK: [2016-11-10 jue 13:07]--[2016-11-10 jue 13:43] =>  0:36
en especial si uno esta atendiendo el telefono.
No me decido. Habria que reformular el ver. Poner la parte que tenemos
en Fechar.
Agregados los campos que tiene fechar, que pueden permitir editar por
ejemplo una direccion, o algo relativo al cliente, que no sea un
fechamiento.
Terminamos una muy linda edicion basica de tabVer, campos basicos, por
separado hare los campos textos.
muy agil el boton ver en fechar, y le di un poquito mas de visualidad
de elementos claves como deuda, pmovto.

** DONE poner el tbl de art comprado a la vista y dejar el subtab para editar
CLOCK: [2016-12-08 jue 22:09]--[2016-12-08 jue 22:56] =>  0:47
quedo bueno, incluso en un futuro si soluciono dos cosas puedo
prescindir del subtab articulos.
Una es lograr que el tablelist me tome el combobox y otra es que tenga
un sistema de stock que no se base en triggers. Sino en sumas reales
de detvta. Desde un cierto punto o desde cierto idvta, lo cual no es
dificil de hacer.
** TODO hacer un subtab que se vean las cuotas adeudadas con los recargos 
CLOCK: [2016-11-10 jue 20:27]--[2016-11-10 jue 21:06] =>  0:39
CLOCK: [2016-11-10 jue 13:48]--[2016-11-10 jue 14:02] =>  0:14
y las sumas como para una atencion mas eficiente de un llamado por
intimacion. si el subtab esta aparte del tab cuentas, se puede hacer
un resaltado diferente para lo que ya esta vencido, y tener un tab
sumador.
¿porque el cuotas adeudadas no es sumador?
tendria que tener la facilidad de sumador para calcular al vuelo lo
que debe alguien con recargos.
En realidad los tbls de class Cuentas no suman pq no son llenados con
metodo llenar, sino con insert en pelo. La solucion luego de
declaradas las columnas fue poner que columnas queremos totalizar y
lanzar el metodo asignaratributos, ya que no va a ser lanzado por
ningun otro metodo (generalmente lo hago con el metodo llenar, en
forma directa, o bien con el expreso colsel)
cuotasdebe.colstotalizar = [2,3,4]
cuotasdebe._asignaatributoscolumnas()
Se podria incluso guardar un coloreado diferencial para los
totalizados de cada tbls. 
p.e. 
cuotasdebe.resaltadototalizar=['lightyellow','black','ubuntu 13 bold']
y que se tome de alli.
Listo, no solo tengo resaltado en los tabs de cuentas sino que se
puede modificar a voluntad para que lo podamos adecuar al contexto.

** TODO hacer que el Mostrar cuotas-debe sea totalizable en cuota/recargo
** TODO transformar los comentarios a registros individuales en tabla aparte
** TODO poner stab de intimaciones en tabVer
** TODO adeduado manejo de los llamados telefonicos que deriven de las intimaciones
mas que todo dentro del tab ver.
** DONE info verificacion seven
CLOCK: [2016-11-16 mié 12:50]--[2016-11-16 mié 13:06] =>  0:16
como una info mas que usualmente se carga durante un pedido pero se
puede cargar en otro momento.
Ahora es visible ese campo en el tabVer universalmente accedido, y
queda pendiente que se pueda editar. Una vez que se pueda editar sera
facil agregar una infoseven de un pedido ya pasado.

** TODO campo nuevo tag u otro tipo campo fts
de busqueda de datos privados, los datos searchables son publicos, de
paso revisar que campos estan incluidos en goo1.
pero una situacion, p.e. una clienta te llama y quiere ser vendedora y
yo anoto en comentarios, o una clienta es pariente de un promotor, y
luego como busco eso??

** DONE Historial de pedidos
CLOCK: [2016-11-18 vie 11:45]--[2016-11-18 vie 12:20] =>  0:35
un subtab extra con los pedidos sacados y su correlato.
listo, un subtab extra en tabVer que no parece que pese tanto y los
pedidos de ese cliente, en todos sus campos, y resaltado con el codigo
de color que acostumbramos.
Perdi unos minutitos y puse unos labels de aclaracion de ayuda en
Pedidos, con las letras que cambian status, y que significan los
status, y que color tienen asignado.
| status | color     |   | significado              |
|      0 | gold      |   | pendiente                |
|      1 | green     | e | entregado                |
|      2 | indianred | A | anulado por la empresa   |
|      3 | royalblue | Z | rechazado por el cliente |
Sirva esto de documentacion
Esta bien es feucho, la ayuda en pantalla, pero consideremosla
provisoria, sino despues quedan un monton de cosas programadas que no
se usan nunca, ni siquiera por mi que soy el destinatario del 99% del
programa que estoy escribiendo.

Pongo directamente E y dejo todos los binds con mayusculas
para unificar criterios.

** DONE mejor y mas fluida entrada del buscar
o sea selecciono y debo volver a marcar el que esta seleccionado al
menos con negrita.
y que se seleccione tmb con un click si se puede.
y que con Ctrl-click se habra en fechar.

* Bug reaparece
** tabFechar
CLOCK: [2016-11-01 mar 20:46]--[2016-11-01 mar 21:32] =>  0:46
Habria que revisar con gitlab, linea por linea para atras lo que pueda
haber afectado el enter en los campos con bind pq esto antes no
estaba.
Podria llegar a ser que los campos, no importa que sean entry o
labelentry esten bindeados con return (o el virtual enter). Siendo que
estan biendeados como all para movimiento, y en cambio cuando los
bindie con focusout anduvo. veamos.

Cuando pensaba que estaba solucionado me aparece un nuevo twist.
lo pruebo en el ejemplo anterior, y anda bien, pero me corrompe el
campo siguiente, en este caso el nombre.

Pueden ser muchas cosas, ahora lo vamos aislando y sospechando de los
bind de paso de campo, pero porque no se manifestaron antes, que los
hizo aparecer ahora.

Lo altamente sospechoso ahora es como si me internara en un juego de
terror, es que anulando los bind de paso de campo el bug sigue igual y
se manifiesta en el campo siguiente con focusout.

Es tan raro que me hace sospechar del teclado, pero en tal caso
andaria mal orgmode y emacs y todo.

Revisaremos todo mañana cuando no este tan cansado.
** reviso con pycharm lado a lado
CLOCK: [2016-11-03 jue 20:49]--[2016-11-03 jue 21:47] =>  0:58
CLOCK: [2016-11-03 jue 13:43]--[2016-11-03 jue 14:19] =>  0:36

revisando parte que anda parte por parte
*** padron femenino/masculino
nada por el momento
*** No entiendo nada. nada. nada.
quiero ver que archivo lib.py esta tomando y los borro a todos, y los
cambio de nombre y el archivo sigue arrancando como si nada.
Este bug me esta consternando. Es una lastima porque venia bien y me
esta cansando, me esta agotando.
Ya no me gusta nada.
*** parece nomas que el problema es con lib.py
Despues de procesar todo, e ir agregando parte por parte y probando
todo, se obtiene que nada es diferente.
Y que la unica posibilidad es que python se deje llevar por el cache y
alli algo se corrompa en un momento y por mas que el archivo este
bien, nada parece andar.
Abria que borrar el cache. Investigar si despues se puede andar sin
cache.
* tab-Doc
** DONE Marcar doc como llevado a oficina/devuelto
CLOCK: [2016-11-09 mié 21:17]--[2016-11-09 mié 21:35] =>  0:18
CLOCK: [2016-11-09 mié 20:51]--[2016-11-09 mié 21:17] =>  0:26
CLOCK: [2016-11-09 mié 20:27]--[2016-11-09 mié 20:34] =>  0:07
CLOCK: [2016-11-09 mié 19:54]--[2016-11-09 mié 20:20] =>  0:26
CLOCK: [2016-11-09 mié 19:34]--[2016-11-09 mié 19:40] =>  0:06
lo mismo me da ganas de pasar a un sistema de status como los pedidos,
y no multiples campos.
Pase a un sistema de status y colores, muy simple y permite que se
pueda cambiar de status simplemente. Y como sirve para imprimir y
visualizar esta todo ok.
Listo quedo creo que terminada la interfase documentos, tanto en lo
que queria para recopilar, sacar un listadito fisico, y llevar un
control de llevados a oficina, devueltos y perdidos, para no volver a
buscarlos.

* TODO Generales
** Mejorar o bien cambiar los combos de bwidget
en especial el tema focusnext con enter. y busqueda case insensitive
** TODO campos entry mas diferenciados o cambios generales en el theme
CLOCK: [2016-11-09 mié 21:51]--[2016-11-09 mié 22:12] =>  0:21
pq en realidad se hace muy confuso, y el sistema en general tiene que
ser usable para todo el mundo y que todos entiendan bien, y todo tan
oscuro donde la ubicacion o directamente la existencia de los campos
no esta determinada, no es nada muy logrado.
Por el momento me decido por el MistyRose para no hacer tanto
colorinche.
Y de paso hacer un contraste bien claro a los campos.
** TODO ver la forma de que el optiondatabase se tome como proyecto
CLOCK: [2016-11-11 vie 21:25]--[2016-11-11 vie 22:20] =>  0:55
pq se toma con el dir como la base de datos lo cual no sirve para git
y en caso de cambios queda fuera de clone y demas.
 
** Agregar ayuda en todos los tabs que sea uniforme
tanto respecto a lo que se puede o debe apretar, como a lo que
significan ciertos colores, o marcas.
p.q pe uno olvida como se hacen ciertas cosas, y lo que significan
ciertas cosas. p.e. con tal letra marque tal cosa, y el color tal
significa tal cosa.

* TODO Modulos futuros
** TODO modulo de cambios de direcciones con tabla aparte
** DONE modulo de agregado o edicion de calles/barrios/zonas en una sola tab.
** TODO modulo de devoluciones de articulos
*** DONE modificacion de detvta en tabVer
CLOCK: [2016-11-16 mié 19:39]--[2016-11-16 mié 20:05] =>  0:26
**** DONE borrado de un item de detalle de venta
CLOCK: [2016-11-16 mié 20:15]--[2016-11-16 mié 21:03] =>  0:48
**** DONE edicion de los campos de un item de detalle de venta
ok se puede modificar ic, cc, art, cnt, costo.
Veremos si puedo modificar art con combobox.
Desisto de modificar con combobox luego de probarlo.
el ttk::combobox no require autorizacion o mejor dicho inicializacion
como el BWidget. No obstante para cargarlo de values con
editstartcommand me falla pq el metodo editwinpath no me entrega en
python una relacion directa al combobox para trabajar con el, sino que
alude a un objeto oscuro tcl-tkinter. Igual pasa con los proc de
edicion cuyos parametro tbl pasado no me sirve para referenciar el
tablelist que lo llama. En fin, no me voy a meter en los fondos de un
tbls que bastante bien funciona y siendo que no fue programado para
python, tendria que tener otra solucion. 
O bien una muy rebuscada que introduciendo el codigo de articulo se
expandiera al nombre del articulo, o bien tener un lista de articulos
actualizada y facilmente accesible donde hacer cortar y pegar, cosa de
que antes de editar uno ya tenga copiado el articulo que quiera pegar.
**** DONE triggers modifican ventas.art
CLOCK: [2016-11-17 jue 12:09]--[2016-11-17 jue 12:15] =>  0:06
ya existen para ins/del detvta, calculan el total para cnt y una
funcion concat contatena los arts para art.

update ventas set cnt=(select sum(cnt) from detvta where
idvta=new.idvta),art=(select group_concat(art,'|') from detvta where
idvta=new.idvta) where id=new.idvta;

Intentare para update de cnt y art tmb.
**** DONE listita de articulos para pegar facil
CLOCK: [2016-11-17 jue 12:15]--[2016-11-17 jue 12:37] =>  0:22
listo, no es muy churro pero es efectivo, resaltando y Control-C
copiamos y luego podemos pegar con Control-V o boton medio del raton.
**** DONE agregado facil de otro item ya con id/idvta puesto
CLOCK: [2016-11-17 jue 12:38]--[2016-11-17 jue 12:53] =>  0:15
para que sea facil agregar el item que falta y que si es posible se
llene solo el ic/cc/costo con lo que esta cargado en tablas.
el agregado de los datos de ic/cc/costo tendria que ser a traves de
trigger al editar el articulo, pero por ahora lo considero superfluo,
al menos en un sistema de editado manual en el cual, se puede acomodar
facilmente.
*** DONE modificado de registro de venta o cuenta
CLOCK: [2016-11-17 jue 19:46]--[2016-11-17 jue 20:33] =>  0:47
en especial cc/ic/ent/primera/idvdor/ y de paso mostrar tmb en Ver
estos dos ultimos datos que no estan visibles.
Con eso terminariamos el proceso de un cambio todo dentro del tabVer
cambio que se estaba haciendo a mano con los riesgos que eso implicaba
*** TODO proceso de devoluciones es algo aparte
pq aparte de poner en LN al cliente, y borrar la cuenta, requeriria el
llevar algun tipo de registro.


** modulo de atencion de avisos y esquemas de promocion
* DONE tabVer accesible desde todo el proyecto
CLOCK: [2016-11-13 dom 19:25]--[2016-11-13 dom 19:46] =>  0:21
Considero todo el proyecto un mamarracho. El problema es el espacio y
el uso del espacio, hay muchas cosas buenas en las cuales se ha
avanzado y hay otras en las cuales no.
Me parece que tendria que haber un tabvercuenta que seria el F13 que
permita analizar todo sobre el cliente y que se pueda acceder desde
cualquier lado en forma facil, tipo hipervinculo, o sea sea cual sea
lo parcial en lo que este trabajando si quiero ver toda la historia
hago doble click sobre cualquier cosa del cliente y me voy ver la
cuenta.
Y ahora como estoy en los compartimientos estancos no puedo verla.
Incluso se tendria que poder ver para cuando esta fechado y poderse
fechar tambien en ese caso desde ahi, y que fechar sea solo para las
planillas.
Se puede ver la cuenta desde
| fechar  | dobleclick idcl                                |
| doc     | dobleclick desde tbl y desde cuadro busqueda   |
| pedidos | idem desde tbls y cuadro busqueda              |
| seven   | dobleclick en ambos tbls que muestran clientes |
| ventas  | en todos los tbls y en el idcl del primer subt |
| fichas  | doble click en el tbls.                        |
Con esto termino todos los links, o sea en todos los lugares donde se
pueda pretender ver la cuenta del cliente que se esta trabajando se
hace dobleclik izq o derecho y se llega a la cuenta.
** DONE interconexion en tabver idem a pedidos por callenum
CLOCK: [2016-11-17 jue 20:34]--[2016-11-17 jue 20:42] =>  0:08
muy interesante conexion, ya que permite "subir" los datos rapidamente
al cuadro de busquedas, siendo que aterrizamos en tabVer desde
cualquier lado.
** DONE edicion en tabver!!!!!!!
** DONE vista de pedidos en tabver
poner los campos relevantes primero, como comentario, y colorear de
ultima como en los otros lados.
** DONE urgente aunque sea poder editar que alguien esta en el seven sin tener que pasar pedido

* TODO Modulo pasar ventas
con la base de pedidos, creo que tendria un pasar ventas facilmente.
** DONE desde pedidos con numero de pedido y listo
** desde clientes con mas facilidades de ingreso de datos
*** informe seven/horarios/mjecobrador
** el stock se debe manejar de otra forma, la forma actual es obsoleta.
*** el articulo no se debe restringir en el pasado, si se vendio es pq hay
*** el stock se debe calcular en forma directa, no por triggers
creo que se usaron trigger por usar trigger no pq fueran eficientes
para esto, y generaron mucha imprecision.
* Explorar posibles nuevos optiondatabase
con otros "themes", colores y combinaciones que hagan mas legible el
pasado de datos. Y la lectura de datos.
* DONE chequear posibles bugs
** DONE tab order en pasado de pedidos que salta de num a los tbs 
CLOCK: [2016-11-18 vie 11:23]--[2016-11-18 vie 11:26] =>  0:03
y no sigue a barrio y zona.
Listo. Era el bind en num, que buscaba los que viven en la direccion
** DONE que paso, se achicaron los cuadros de busqueda y se agrando el campo de arriba
CLOCK: [2016-11-18 vie 11:38]--[2016-11-18 vie 11:40] =>  0:02
No parece estar distinto
* TODO improvs
** DONE linkear desde fichas a fechar para despejar fichas.
CLOCK: [2016-11-18 vie 19:31]--[2016-11-18 vie 19:52] =>  0:21
listo- accedido
** TODO boton de impresion directa de zonas Atajo
es embolante tener que hacer el proceso en especial cuando son zonas
multiples.
que se imprima directo resumen y zona 
** TODO reacomodar tabVentas
poner fichitas atras y quieren comprar adelante y limitar el ancho de
la columna que invade todo.
* DONE tabCobrado
** DONE pivot por cobrar
CLOCK: [2016-11-21 lun 12:32]--[2016-11-21 lun 13:50] =>  1:18
hecho, salio la tabla, aunque la calcule en forma atipica. probada en
un solo caso, necesitaria mas testeo.
Pero haciendo un select sum(saldo) from ventas where fecha>idem fecha
tomada o sea desde 2014 tengo el mismo saldo, lo cual me indica que es
un numero bien exacto, y con la confirmacion que me da que el vto ha
sido bien asignado, debo concluir que el pivot es cierto.
De ahi para arriba hay mucho para poblar en este tab, pero lo mas
importante y lo mas dificil esta, con excepcion quiza del mes pago,
mes venta, pero ese sale de un select mixto no de una tabla virtual.
Otro ejemplo mas que algo que parece dificil en realidad se hace y se
hace en una mañana en la cual uno no esta cien por cien.
** DONE generalizar la disposicion para poner mas vistas
CLOCK: [2016-11-21 lun 19:28]--[2016-11-21 lun 19:41] =>  0:13
y agregado proyeccion/por zona
** DONE agregar a tabla virtual cuotas status pago
CLOCK: [2016-11-21 lun 20:20]--[2016-11-21 lun 20:40] =>  0:20
hecho, quedo bien con tres status menos de 30 dias de pmovto y entre
30/90 dias.
** DONE ver si se puede por mes de ultpago

se pudo, y es bastante sutil.
y le agregue pmovto.
* Poner las planillas de cobrador dentro de una pestaña
* DONE Sumador
CLOCK: [2016-11-24 jue 12:16]--[2016-11-24 jue 13:40] =>  1:24
ver si puedo hacer un sumador en un tab. Ventajas, el teclado de la
compu siempre sera mejor que la calcu, aparte, es visible, es
editable, no tengo que sumar dos veces, sino controlar, aparte me
calcula el 15 solo. 
Hizo renegar un poco el sumador, mas de lo debido, pero ya esta y creo
que es algo muy usable en el dia a dia.
* TODO campo msg-vendedor para alertar al vendedor / Puntaje?/ Limite?
el msg podria actuar ahora como un protopuntaje. pq permitiria que
salga el dato pero con ciertos avisos.
Ver caso Quevedo Martha JID23
* TODO tabSeven
** DONE Sistema de baja del seven
CLOCK: [2016-12-06 mar 13:26]--[2016-12-06 mar 14:31] =>  1:05
Empiezo el analisis del tema. 
De paso corregi el proceso de anotacion de las subidas para que las
haga por id no por bloque y de paso se corrige que si tiene sev=1 o
sea si esta subido al seven, no puede estar subirseven=1 o sea estar
pendiente de ser subido al seven todavia.
que genere el archivo y que genere el log.
** TODO altas desde Fechar
para poder subir mas rapido
** TODO correcciones
*** en tblsubir que este el ultimo pago para analizar a quien subo
no la ultima compra???
*** que la deuda ordene por numero
* bugs
** como tabFechar es ambi-valente
tiene un proceso de coloreado del active,pmovto del tbls pero si la
llamada es de numero de cuenta sola, obviamente da error.
** revisar el proceso de condonacion
no es claro el proceso, y no se ve el resultado, cambiarlo quizas a
letras y colores. y por favor que se updatee el cliente subyacente.
** cuando se genere pedido limpiar cliente
cosa de pasar un cliente nuevo, y evitar error
** DONE ver de solucionar el combo clear y el combo tab
** chequear el proceso de trigger ultpago
para ver si toma real el ultimo o maxima fecha, caso Leonel Bustos.

* DISCUSION SOBRE LAS POLITICAS DE NEGOCIO QUE AFECTARIAN LA PROGRAMACION
** cobro por vendedores hecho con recibo
*** pro:
- el cliente tiene recibo por todos los pagos
- el cliente que paga conoce el recibo desde el primer momento
- no queda un formulario abierto para que el trucho cobre lo que se le
  cante, al menos el recibo esta hecho desde aca
*** contras:
- engorroso hacer los recibos
- aparece el vendedor como cobrador de esa cuota (lo cual puede ser
  positivo pq aclara las cosas)


*** consideraciones respecto al sistema
se dejaria de usar el campo ent, y se sumarian todos los pagos.

* TODO nuevos links vendedor o cobrador
o sea doble click en el numero de cobrador vaya a un tbls de cobrador,
doble click alli te de una lista de ventas de ese cobrador con
indicadores precisos de compra/deuda/direccion de compra.

* Hacia el nuevo esquema de venta 

** Mejor carga de datos del promotor

** ver liquidacion / generar liquidacion
la liquidacion sera los jornales y el basico, mas el puntaje junto a
la lista de operaciones concretadas, y una lista de datos rechazados,
y una lista de datos pendientes si los hay

** generar contrato
no seria necesario pq seria una planilla fija firmada arriba como en
el 2012

** cargar jornales
los jornales se cargan desde la planilla de asistencia que si o si
debo tener. Esa planilla es contrato tambien lamentablemente.
Para cargar, linea de carga fecha, prom, jornal, etc. y abajo el tbls
que representa la planilla.

** tablero de control
jornales, datos, vendido, puntaje, costo.
* modificacion necesaria para que ande en windows
rompio el esquema el agregado de /rx/ al nombre del archivo previo al
directorio,lo cual podria salvarse.
agregar self.st.theme_use("default") para que los combobox se vean
bien.

* DONE tema combobox
CLOCK: [2016-12-11 dom 19:56]--[2016-12-11 dom 20:32] =>  0:36
    pathname = self.nametowidget(tbl).editwinpath()
    self.nametowidget(tbl).embconfigure(pathname,values=lista)
el tbl del editstartcommand(tbl,row,col,text) es un string. Para
    pasarlo a valor de widget uso el metodo nametowidget y eso ya me
    lleva al tbl real.
el metodo editwinpath me da el path del widget que el tbl embebe para
    la edicion. para que pueda alterarlo antes de la edicion, pe
    ponerle valores al combobox.
el metodo nuevo que agregue al wraper de tablelist con el nombre de
    embconfigure (que se llamaria asi pq es el configure del embebido)
    permite configurar directamente el embebido.
tbl.embconfigure(pathname, values= lista)

metodo embconfigure:
#+BEGIN_EXAMPLE
 def embconfigure(self,pathname,cnf={},**kw):
     return self.tk.call((pathname, "configure") +
     self._options(cnf, kw))

#+END_EXAMPLE
Luego de renegar bastante y meterme en el tema, lo que me permitio
buscar, pq sino estas metido en un tema a fondo no podes encontrar
facil las repuestas, y buscando, encontre dos tipos que tenian el
mismo problema, uno plantio bien la pregunta pero nadie le respondio,
y otro se contesto solo, con un parche al wrapper. Lo que hice yo y
ahi creo que estuve genial, pq el parche en si rompia el wrapper, fue
crear otro metodo adhoc para ese motivo con el codigo que mando el
tipo. O sea ya el wrapper del tablelist es casi parte de mi
programacion, pq no se usa asi, tiene muchisimos arreglos.

* DONE bug tabVer
CLOCK: [2016-12-12 lun 20:40]--[2016-12-12 lun 21:09] =>  0:29
si luego de una busqueda cualquiera buscamos con alguien que no tiene
cuentas no limpia los cuadros de cuenta y es confuso.
Hice procesos explicitos de clear() de los tbls envueltos y demas
campos.

** DONE el tabver no estaria mostrando infoseven ni subtabpedidos 
ver p.e. casos desde pedidos y ver que no muestra la info.

* DONE bug tab Visitar:
CLOCK: [2017-02-13 lun 16:13]--[2017-02-13 lun 16:41] =>  0:28
No funciona la emision de listado de clientes a visitar.
Revisar el algorritmo.
bug en tabVisitar
1) se arreglo el orden de las pestañas
2) se arreglo el verdadero bug que no imprimia y era porque el proceso
   usaba la funcion
 imprimirlistado(tbls) que a su vez usa la funcion obtieneids que lo
   que hace es
 obtener los ids del tablelist dado como argumento, y es obvio que los
   id los
 saca de una columna id generica, y como yo habia hecho el tablelist
   quequierecomprar
 un poco freaky, ya desde el nombre, porque podria haberle puesto
   pedido
 no quequierecomprar, y le puse id, idcliente, etc, era un moco
 pq el obtieneids me daba los numeros de pedidos, o sea 125,126,127
 p.e. y no los numeros de clientes y entonces no imprimia nada.
 Lo que hice entonces es cambiar el select para poner el idcliente
 como id, el quequierecomprar.id as num y listo, todo siguio su
 curso normal, incluso en el proc borrarquierecomprar que
 bastante complicadito es safe de tener que cambiar nada pq
 estaba referenciado y lo unico que hice es cambiar los
 origenes de la referencia. Demore mas en escribir esto
 que en arreglar el bug. 
* DONE bug de los dos articulos en tab Pedidos
CLOCK: [2017-02-13 lun 18:02]--[2017-02-13 lun 18:41] =>  0:39
o sea cuando la compra es dos cortinas no imprime bien.

bug en tab Pedido
1) arreglo el problema de que cuando se hace un pedido de dos
 articulos no sale el documento correctamente. Todo porque los
 importes no fueron multiplicados por la cantidad de articulos.
2) saque el automatismo para monoarticulo determinado por
 promocion que puede andar muy bien en un esquema
 superespecializado pero tambien un esquema abierto es superrapido
 y da mas opcion tanto a poner otro articulo como a poner
 otro precio y plan de la misma cortina.
3) agregado de limites en los campos posibles de entrada de
 datos para que no estropeen la salida en el pedido, en
 descripcion de articulo o color. Usando el truncating de
 la funcion format que es asi: '{:.30}'.format(contenido),
 donde ahi se trunca a 30.
* TODO sistema de atencion telefonica
** al marcar llamar en fechar guardar en tabla llamar
CLOCK: [2017-02-23 jue 17:55]--[2017-02-23 jue 19:22] =>  1:27
Hecha la primera aproximacion, que seria registrar la intencion de
llamar en una tabla, para que funcione como los pedidos de articulos
dentro del proceso interno de fechar, y un poco uno se monta al
proceso que viene haciendo con eso.
** ver listado de llamados pendientes para hacer 
o sea el tablelist de la tabla llamar con link a las cuentas.
** Posibilidad de llenado del registro de llamado en el momento en que se esta haciendo el llamado
** visualizacion del historial de llamados en la ficha del cliente.
* TODO tab PasarVentas [nuevo]
Esto es todo un proceso nuevo de pasado de ventas que reune en una
sola integralidad o unidad todo un numero de tareas e inteligencias
que uno las veia por separado y ahora uno las va a pensar en forma
global en un solo lugar.

** TODO subtab pasado propiamente dicho
CLOCK: [2017-08-28 lun 20:43]--[2017-08-28 lun 21:32] =>  0:49
CLOCK: [2017-08-28 lun 19:39]--[2017-08-28 lun 20:17] =>  0:38
reuso el pasado de pedidos y cambiare la parte de abajo
quiero tener la funcionalidad de buscador y de poner el numero de
pedido y cargar todo
Se hizo la primera parte, se reusa todo pq al estar en un metodo
distinto no colisionan los nombres.
Y pongo una busqueda con pedido que carga todo, al menos el cliente,
por ahora.
Se agrego una interface muy completa donde se carga lo que contiene el
pedido y luego se podra cargar la cuota y el recibo, lo cual se
procesara aparte y los datos de clientes.
*** TODO guardar venta
CLOCK: [2017-09-03 dom 19:40]--[2017-09-03 dom 21:00] =>  1:20
CLOCK: [2017-09-03 dom 11:28]--[2017-09-03 dom 12:28] =>  1:00
CLOCK: [2017-09-02 sáb 15:59]--[2017-09-02 sáb 17:45] =>  1:46
CLOCK: [2017-09-02 sáb 13:45]--[2017-09-02 sáb 14:33] =>  0:48
CLOCK: [2017-08-31 jue 20:07]--[2017-08-31 jue 20:55] =>  0:48
CLOCK: [2017-08-30 mié 18:34]--[2017-08-30 mié 20:34] =>  2:00
CLOCK: [2017-08-29 mar 18:56]--[2017-08-29 mar 21:01] =>  2:05
se incluyen dni firmante-nombre y relacion
Me cago en los comboboxs, no sirven ninguno de los dos.
el bwidget que parece que funcionara bien no lo hace pq no pasa con en
enter y eso ralentiza el pasado de datos a velocidad, (si bien hay que
tener en cuenta que esto es una notebook y yo paso en una compu).
y el ttkcombobox es un pain. pq lo mismo no sirve pq el autocompletado
no reacciona y te hace cometer errores.
No funciona como en tcl.
Por lo menos hice la primera parte del guardado en la base venta,
faltaria el detalle de venta, y luego el pasado en la tabla pagos,
creo que para el fin de semana tendria que tenerla pulida, lo cual
estaria bien, por ser una de las grosas, luego seguiria el pasado de
recibos y luego el de caja como los tres grandes.

Se hizo todo el guardado de la venta y la emision del numero de venta,
y el guardado del detalle de venta.
Falta muchisimo pulir en la seguridad de los detalles y de los datos,
para que tenga consistencia, pero hacia alla vamos, no vamos a dejar
ahora.
Puse en el sector de pasado de ventas colores diferentes por sector
logico de pasado para tener mejor vision del formulario.

Termine de pulir distintos temas y ya estoy probando todo funciona
bien salvo el pmovto que no funciona perfecto pq la funcion round de
sqlite me hace calcular mal y cuando han pagado mas de la mitad de la
cuota te pone que vence el mes que viene. vamos a trabajar con ella
para ir viendo y vemos sino no avanzare.

**** excurso Pmw-combobox
CLOCK: [2017-08-31 jue 22:28]--[2017-08-31 jue 23:28] =>  1:00
no estoy disconforme del todo puede ser tuneado luego con respecto a
la apariencia, pero lo bueno que funciona con teclas de direccion y se
podria acomodar con frecuencia de uso para el articulo puede ser mas
util que poner codigo incluso para un novato/ o sea no debo obligar a
usar codigo y puede que no sea riesgoso equivocar el uso de los
articulos.
**** como agregado me pone un callback con mensaje tipo tcl de errores
lo cual no viene mal, dentro de la aplicacion, pq no te deja tan en
bolas.
p.e. foreing key / database locked, etc.
**** resultado del uso del pmw-combobox en el articulo
1. el metodo clear no va pq borra la lista directamente y lo deja
   vacio
2. se pudo aplicar un ordenamiento por lo vendido los ultimos 1000
   ventas, logrando que se vean los resultados mas relevantes arriba
3. se ve el codigo y el articulo, el codigo resalta o hace mas segura
   la eleccion
4. es comodo elegir con el raton desplegando el combo para el empleado
**** futuro de Pmw
creo que tiene futuro, pq al ser algo de python se integra muy bien
con dos lineas de codigo y se instala en un segundo, con pip3 install
pmw.
Me parece que voy a encarar en el futuro por ahi para tunearlo.
**** uso del pmw-combobox
CLOCK: [2017-09-02 sáb 10:32]--[2017-09-02 sáb 11:40] =>  1:08
tiene un metodo selectitem() que permite asignarle un item (o sea como
seria nuestro metodo set, que no hace falta que sea como en bwidget
buscandole el index, sino que le podemos mandar el valor directamente
y el trabajo lo hace el.
**** TODO falta poner el pasado de lo accesorio de aclaracion/horario etc
que se llenaria abajo para no ir arriba
*** DONE venta preprocesada de pedido unitario
se podria ganar muchisimo tiempo si el numero de pedido no solo
cargara el cliente sino tambien cargara detalle de venta el articulo,
ya listo para dar el teclazo al guardar item, o sea que con dos
botones pasamos la venta.

*** DONE asegurar que no se pueda procesar mal una venta
CLOCK: [2017-09-02 sáb 16:45]--[2017-09-02 sáb 17:46] =>  1:01
o sea que no haya la chance de procesar un item sin numero de venta
por ejemplo.
Se aseguro que si se pone mal un numero de pedido sale un balloon y se
bloquea para poder poner un cliente.
se pone por defecto entrega 0 para no dar problemas futuros en los
calculos. y en el levantamiento del pedido se pone tambien por default
la fecha de la primer cuota.

*** DONE avisos varios con balloon de colores
CLOCK: [2017-09-04 lun 20:06]--[2017-09-04 lun 21:06] =>  1:00
los balloons son practicos pq entregan informacion visible en el lugar
y de color no dejan de ser vistos. 
se logro un buen avance en ese sentido que dejo un poco obsoleto el
pedidos pero YA LO PONDREMOS A TONO.

*** TODO proceso de firmantes
incluir en tabVer la info de los firmantes y en pasar ventas que al
poner el dni se chequee los datos
*** TODO condonados
poner que cuando paso una venta se necesita condonacion y condonar
desde alli mismo
*** TODO paso de datos de la primer cuota y su recibo
CLOCK: [2017-09-02 sáb 19:40]--[2017-09-02 sáb 21:43] =>  2:03
incluso hacer una planilla de caja o que pueda visualizar en el tbls
de control para el control de la planilla que me pasa fede
**** TODO Problema del pmovto
CLOCK: [2017-09-02 sáb 20:43]--[2017-09-02 sáb 21:44] =>  1:01
no se pq con python tenemos problema para la function en sqlite de
pmovto.
esto es algo que viene de hace rato.
Se podria hacer por trigger.
Seria cuestion de ser prolijos y transformar los trigger y listo.

ya pasamos uno, en pagosINS y aparentemente funciono bien. Habria que
ver si hace falta pasar otro. v
***** TODO arreglar trigger en PagosDEL y Pagos UPD
en forma similar a lo hecho en PAGOSINS

*** TODO paso reafirmado de horarios aclaraciones y msg cuando paso la venta
o sea un editado de clientes secundario
*** TODO proceso de pasado del detalle de venta
con facilidad de ver la suma de lo que se va pasando y lo que falta 
*** TODO pendiente el tema campo anticipo 
para la generalidad de vender con anticipo y como se procesa eso en
los otros procesos de la empresa
*** TODO pasado de ventas stand alone
pq no voy a poner todo el F7 atras para que la chica pase tendria que
estar solo como programa aparte
con herramientas de verificacion para poder controlar comoda y
exhaustivamente todo lo que se paso.
*** TODO cuadro para el testeo y agregado de calles nuevas
que es un tema cuando se pasan ventas nuevas a menudo



** TODO st2 visor de pasado de ventas
ver si puedo ordenarlo por fecha de pasado no por fecha de venta que
puede ser varia.
que sea editable el tbls
que a su vez me indique como el verificar en forma facil los que
necesitan fichas para cobrar rapido

Hice un listado de las ultimas 1000 ventas, pero no me aparece el
scroll
pero se ve bien.
lo mismo con alt--> se va a la ultima columna y viceversa, y con
control up igual a gg y control down G  o sea que un tablelist gigante
se navega muy rapido con esas teclas.

*** poner un campo en ventas con una fecha datatimedefault

*** hacer editado de algunos campos editables
p.e. idvdor, cnt cuotas, importe, etc. ver

*** hacer borrado
para no tener que necesitar mas editar ventas de tcl.

** TODO posible st3 visor reducido de cuotas cobradas en el pasado reciente 
para control rapido del pasado de papeles. 


* TODO Temas generales
** DONE scroll para tablelist
CLOCK: [2017-08-22 mar 20:07]--[2017-08-22 mar 20:49] =>  0:42
empiezo a ver si puedo resolver esto pq es un tema problematico en el
dia a dia.
Ya esta resuelto.
Se hizo como una condicion con un parametro, como el titulo del
tablelist, y se hace con un doble packeado que no le hace nada
aparentemente.
O sea se lo packea dentro de la clase y luego en el uso de la
instancia.
Seria facil hacer un scroll vertical copiando todo, pero no veo que
sea muy necesario pq el tbls corre bien verticalemente, pero
pobremente horizontalmente, y necesita un scroll horizontal.
Y se puede usar el no temeado pero no es muy lindo que digamos.
** TODO agregarle scroll-horizontal a todos los tbls que necesitan
** TODO programar en el xmodmap las teclas mayor y menor
** DONE stripebg en tbls que cambie por fecha
CLOCK: [2017-09-02 sáb 12:05]--[2017-09-02 sáb 12:29] =>  0:24
p.e. en tbls de pedidos a imprimir seria util que visualmente se
vieran coloreados los diferentes dias con distintos colores. No creo
que sea dificil lograrlo.
Se hizo para la pestaña pedidos a imprimir, bastante facilmente.

** DONE freezado de columna para el tablelist
aca lo use en el tbls editar para que en especial la tabla cobr me
quede fijo el idcobr cuando edito otros datos.
busque la propiedad mucho pq no me acordaba, aunque sabia que existia
era titlecolumns=numcol que queremos freezar, o sea muy facil
* bugs
** problema database locked
CLOCK: [2017-08-27 dom 10:03]--[2017-08-27 dom 12:03] =>  2:00
CLOCK: [2017-08-27 dom 21:03]--[2017-08-27 dom 23:03] =>  2:00
aparecio de golpe no dejando escribir en la base de datos esta mañana
cuando programaba la pestaña de pasado de datos de promotores.
busque una solucion de recupero y pude seguir trabajando alli, pase
promotores y demas.

luego detecte que no funcionaban bien los combobox bwidget y que la
parte clientes de la pestaña pedidos no cargaba dni y clientes y que
no se podia pasar clientes.

primero me decia que el dni violaba la condicion de unique, y luego al
poner otro dni totalmente imposible que fuera, salia con lo de la
database locked.

pense que tener el seteo de los bwidget dentro del bwidget.py podria
hacer que la base de datos trabajara de mas, incluso vi un delay la
primera vez que se accedia a un combobox, entonces saque la funcion o
metodo set dentro de bwiget.py y puse en cada lugar el seteo a mano
con el correspondiente busqueda del indice.

Luego unifique las listas de calles, zonas, y barrios que son usadas
siempre al comienzo de la aplicacion y que los combos la tomen de ahi,
y no las genero a cada rato

aparentemente los combos funcionan bien y cargan bien.aunque creo que
en la pestaña pedidos sigue el delay en la primera busqueda.

y sigue sin cargar dni y nombre

y no se puede pasar un cliente nuevo pq te da database locked.

Si se puede usar en carga de datos de otras tablas.
pero cuando quiero cargar un cliente aparece ese error y eso bloquea
la base, cierro el programa y queda bloqueada y nada la desbloquea

habria que descubrir que cambio hice este fin de semana que altero
tanto que el dni sea no unique, que cuando pase la venta no hizo clear
de dni y nombre, y no cargue dni y nombre o sea tiene problema con
esos dos campos.

Solucionado:
Era que el st4 en el mismo metodo, tenia una colision de nombres, pq
compartian el mismo nombre el formulario de pasado de promotores, dni
y nombre de ahi el error. POr eso no cargaba y por eso andaba mal
todo.
Y la base de lockeaba justamente pq se cometia un error de
inconsistencia y se cerraba el programa sin desconectar, lo cual nunca
me ocurre pq todas las transacciones son consistentes.


